//	FLVCore Errors

FLVCoreError_0	=	"Not an error.";
FLVCoreError_1	=	"An internal application error occurred.";	//	errInvalidInputKind
FLVCoreError_2	=	"An internal application error occurred.";	//	errNoSuchStream
FLVCoreError_3	=	"An internal application error occurred.";	//	errNoProgressObject
FLVCoreError_4	=	"An internal application error occurred.";	//	errInvalidFunctionParameter
FLVCoreError_5	=	"An internal application error occurred.";	//	errBadSource
FLVCoreError_6	=	"A required system library did not initialize properly. Please ensure you have QuickTime 7 or higher installed on your system.";	//	errSupportLibInitFailed
FLVCoreError_7	=	"The source media file is in an unsupported format and cannot be encoded.";	//	errUnsupportedSourceFile
FLVCoreError_8	=	"The source media file contains only video in an unsupported format and cannot be encoded.";	//	errUnsupportedVideoFormat
FLVCoreError_9	=	"The source media file contains only audio in an unsupported format and cannot be encoded.";	//	errUnsupportedSoundFormat
FLVCoreError_10	=	"The source media file ended unexpectedly and was not encoded. Please check the source file.";	//	errEndOfStream
FLVCoreError_11	=	"The operation was interrupted by the user.";	//	errUserCanceledOperation
FLVCoreError_12	=	"An internal application error occurred.";	//	errNotImplemented
FLVCoreError_13	=	"The source media file has copying restrictions and cannot be encoded.";	//	errFileHasDRM
FLVCoreError_14	=	"An internal application error occurred.";	//	errInternalFatalError
FLVCoreError_15	=	"The output file could not be written because a file of that name is open in another application.";	//	errOutputOpenFailBusy
FLVCoreError_16	=	"The output file could not be written because you do not have enough system privileges.";	//	errOutputOpenFailPerms,
FLVCoreError_17	=	"The output file could not be written because of a system error.";	//	errOutputOpenFailGeneric,
FLVCoreError_18	=	"The output file could not be written because FLV files cannot be longer than 278 minutes.";	//	errFileTooLong,
FLVCoreError_19	=	"The output file could not be written because there was not enough disk space.";	//	errOutOfDiskSpace,
FLVCoreError_20	=	"The source media file could not be found.";	//	errSourceFileNotFound,
FLVCoreError_21	=	"The output file could not be written because of a system error.";	//	errGenericFileWrite,
FLVCoreError_22	=	"An internal application error occurred.";	//	errUnrecognizedProperty,
FLVCoreError_23	=	"The encoding settings you have set up are not valid.\n   • You must encode either video or audio.\n   • You can only have one cue point at a particular timecode.\n   • Your final video size must be at least 32x32 pixels.\n   • You must specify a data rate when encoding video.";	//	errCannotAcceptPaneSettings,
FLVCoreError_24	=	"The source file could not be read because it is compressed with a video codec that is not present on your system.";	//	errCannotReadSourceVideoCodec
FLVCoreError_25	=	"The output file could not be created because its parent folder could not be found or does not exist.";	//	errOutputOpenFailPathNotFound
FLVCoreError_26	=	"The XML file could not be loaded because it is in an invalid format.";	//	errInvalidParameterSettings
FLVCoreError_27	=	"The XML profile file could not be loaded because it is a cue points XML file. Please load this file from the Cue Points tab.";	//	errCuesNotProfile,
FLVCoreError_28	=	"The XML cue points file could not be loaded because it is a profile XML file. Please load this file from the Profile tab.";	//	errProfileNotCues,
FLVCoreError_29	=	"The operation could not be completed because an error occurred.";	//	errLastError/errGenericError


//	FLVCore Strings

FLVCore_Warning				=	"Warning";
FLVCore_CuePtDelNotUndoable	=	"Are you sure you want to delete the cue point? This action is not undoable.";
FLVCore_ParamDelNotUndoable	=	"Are you sure you want to delete the parameter? This action is not undoable.";
FLVCore_FileWriteFailure	=	"An error occurred when trying to write the XML file. Please check that the file is not locked and you have the appropriate permisions and try again.";
FLVCore_CuesDiscarded		=	"Some loaded cue points were discarded because they are at invalid times for a clip of this duration.";
FLVCore_SettingsDiscarded_Multiple	=	"Some of the settings (crop, trim, cue points) in the imported profile were discarded because they could not be applied to multiple or unknown input files.";
FLVCore_SettingsDiscarded_Crop	=	"Crop settings in the imported profile were discarded because they are invalid for a clip of this size.";
FLVCore_SettingsDiscarded_Trim	=	"Trim settings in the imported profile were discarded because they are invalid for a clip of this duration.";

FLVCore_DefaultProfileFileName		=	"Untitled Flash Video Profile.xml";
FLVCore_DefaultCuePointsFileName	=	"Untitled Cue Points.xml";

FLVCore_LoadProfilePrompt	=	"Load Encoding Profile";
FLVCore_SaveProfilePrompt	=	"Save Encoding Profile";
FLVCore_LoadCuePointsPrompt	=	"Load Cue Points File";
FLVCore_SaveCuePointsPrompt	=	"Save Cue Points File";

FLVCore_CustomProfileName	=	"Custom";
FLVCore_CustomProfileDesc	=	"Custom Profile";
FLVCore_CustomProfileDesc7	=	"Video encoded for playback with Flash Player 6 or higher";
FLVCore_CustomProfileDesc8	=	"Video encoded for playback with Flash Player 8 or higher";
FLVCore_CustomProfileDescAudioOnly	=	"Audio-only encoded for playback with Flash Player 6 or higher";
FLVCore_CustomProfileDescInvalid	=	"Invalid encoding settings\nEither video or audio encoding must be enabled";
FLVCore_CustomProfileVideo	=	"Video: ";
FLVCore_CustomProfileCodecSpark	=	"Sorenson Spark";
FLVCore_CustomProfileCodecVP6	=	"On2 VP6";
FLVCore_CustomProfileSeparator	=	"; ";
FLVCore_CustomProfileKbps		=	" at %dkbps";
FLVCore_CustomProfileMono		=	" (mono)";
FLVCore_CustomProfileStereo		=	" (stereo)";
FLVCore_CustomProfileVideoOptions	=	"Video Options: ";
FLVCore_CustomProfileAlpha		=	"Encode alpha channel";
FLVCore_CustomProfileDeinterlace	=	"Deinterlace";
FLVCore_CustomProfileAudio	=	"Audio: ";
FLVCore_CustomProfileCodecMP3	=	"MPEG Layer III (MP3)";
FLVCore_CustomProfileCrop	=	"Crop: Top=%d; Left=%d; Bottom=%d; Right=%d";
FLVCore_CustomProfileResize		=	"Resize: Width=%d; Height=%d";
FLVCore_CustomProfileResizePct	=	"Resize: Width=%d%%; Height=%d%%";
FLVCore_CustomProfileRespectAspectRatio	=	"Respect aspect ratio";
FLVCore_CustomProfileTrim	=	"Trim: In=%1.3f secs; Out=%1.3f secs";
FLVCore_CustomProfileCuePoints	=	"Cue Points: ";
FLVCore_CustomProfileCueSeconds	=	" at %1.3f sec";
FLVCore_CustomProfileCuesAndMore	=	"and %d more";

FLVCore_CuePtParamsCaption	=	"Parameters for “%@”:";
FLVCore_CuePtParamsNone		=	"Cue Point Parameters";

FLVCoreProfileNames		=	"FLVCore_Prof_Spark_Modem,FLVCore_Prof_Spark_Low,FLVCore_Prof_Spark_Med,FLVCore_Prof_Spark_High,FLVCore_Prof_VP6_Modem,FLVCore_Prof_VP6_Low,FLVCore_Prof_VP6_Med,FLVCore_Prof_VP6_High,FLVCore_Prof_VP6_DV_Small,FLVCore_Prof_VP6_DV_Large";
FLVCoreDefaultProfileName	=	"FLVCore_Prof_VP6_Med";

FLVCore_Prof_Spark_Modem		=	"Flash 7 - Modem Quality (40kbps)";
FLVCore_Prof_Spark_Modem_Desc	=	"Video encoded for playback with Flash Player 7 or higher\nVideo codec: Sorenson Spark\nVideo data rate: 40kbps\nAudio codec: MPEG Layer III (MP3)\nAudio data rate: 16kbps (mono)";
FLVCore_Prof_Spark_Modem_XML	=	"<?xml version=\"1.0\" encoding=\"UTF-8\" ?><FLVCoreSettings><Version>2</Version><EncodeVideo><VideoCodec>spark</VideoCodec><VideoDataRate>40000</VideoDataRate><Deinterlace>false</Deinterlace></EncodeVideo><EncodeAudio><AudioCodec>mp3</AudioCodec><AudioDataRate>16000</AudioDataRate><AudioChannels>1</AudioChannels></EncodeAudio></FLVCoreSettings>";

FLVCore_Prof_Spark_Low		=	"Flash 7 - Low Quality (150kbps)";
FLVCore_Prof_Spark_Low_Desc	=	"Video encoded for playback with Flash Player 7 or higher\nVideo codec: Sorenson Spark\nVideo data rate: 150kbps\nAudio codec: MPEG Layer III (MP3)\nAudio data rate: 32kbps (mono)";
FLVCore_Prof_Spark_Low_XML	=	"<?xml version=\"1.0\" encoding=\"UTF-8\" ?><FLVCoreSettings><Version>2</Version><EncodeVideo><VideoCodec>spark</VideoCodec><VideoDataRate>150000</VideoDataRate><Deinterlace>false</Deinterlace></EncodeVideo><EncodeAudio><AudioCodec>mp3</AudioCodec><AudioDataRate>32000</AudioDataRate><AudioChannels>1</AudioChannels></EncodeAudio></FLVCoreSettings>";

FLVCore_Prof_Spark_Med		=	"Flash 7 - Medium Quality (400kbps)";
FLVCore_Prof_Spark_Med_Desc	=	"Video encoded for playback with Flash Player 7 or higher\nVideo codec: Sorenson Spark\nVideo data rate: 400kbps\nAudio codec: MPEG Layer III (MP3)\nAudio data rate: 96kbps (stereo)";
FLVCore_Prof_Spark_Med_XML	=	"<?xml version=\"1.0\" encoding=\"UTF-8\" ?><FLVCoreSettings><Version>2</Version><EncodeVideo><VideoCodec>spark</VideoCodec><VideoDataRate>400000</VideoDataRate><Deinterlace>false</Deinterlace></EncodeVideo><EncodeAudio><AudioCodec>mp3</AudioCodec><AudioDataRate>96000</AudioDataRate><AudioChannels>2</AudioChannels></EncodeAudio></FLVCoreSettings>";

FLVCore_Prof_Spark_High			=	"Flash 7 - High Quality (700kbps)";
FLVCore_Prof_Spark_High_Desc	=	"Video encoded for playback with Flash Player 7 or higher\nVideo codec: Sorenson Spark\nVideo data rate: 700kbps\nAudio codec: MPEG Layer III (MP3)\nAudio data rate: 128kbps (stereo)";
FLVCore_Prof_Spark_High_XML	=	"<?xml version=\"1.0\" encoding=\"UTF-8\" ?><FLVCoreSettings><Version>2</Version><EncodeVideo><VideoCodec>spark</VideoCodec><VideoDataRate>700000</VideoDataRate><Deinterlace>false</Deinterlace></EncodeVideo><EncodeAudio><AudioCodec>mp3</AudioCodec><AudioDataRate>128000</AudioDataRate><AudioChannels>2</AudioChannels></EncodeAudio></FLVCoreSettings>";

FLVCore_Prof_VP6_Modem		=	"Flash 8 - Modem Quality (40kbps)";
FLVCore_Prof_VP6_Modem_Desc	=	"Video encoded for playback with Flash Player 8 or higher\nVideo codec: On2 VP6\nVideo data rate: 40kbps\nAudio codec: MPEG Layer III (MP3)\nAudio data rate: 16kbps (mono)";
FLVCore_Prof_VP6_Modem_XML	=	"<?xml version=\"1.0\" encoding=\"UTF-8\" ?><FLVCoreSettings><Version>2</Version><EncodeVideo><VideoCodec>vp6</VideoCodec><VideoDataRate>40000</VideoDataRate><Deinterlace>false</Deinterlace></EncodeVideo><EncodeAudio><AudioCodec>mp3</AudioCodec><AudioDataRate>16000</AudioDataRate><AudioChannels>1</AudioChannels></EncodeAudio></FLVCoreSettings>";

FLVCore_Prof_VP6_Low		=	"Flash 8 - Low Quality (150kbps)";
FLVCore_Prof_VP6_Low_Desc	=	"Video encoded for playback with Flash Player 8 or higher\nVideo codec: On2 VP6\nVideo data rate: 150kbps\nAudio codec: MPEG Layer III (MP3)\nAudio data rate: 32kbps (mono)";
FLVCore_Prof_VP6_Low_XML	=	"<?xml version=\"1.0\" encoding=\"UTF-8\" ?><FLVCoreSettings><Version>2</Version><EncodeVideo><VideoCodec>vp6</VideoCodec><VideoDataRate>150000</VideoDataRate><Deinterlace>false</Deinterlace></EncodeVideo><EncodeAudio><AudioCodec>mp3</AudioCodec><AudioDataRate>32000</AudioDataRate><AudioChannels>1</AudioChannels></EncodeAudio></FLVCoreSettings>";

FLVCore_Prof_VP6_Med		=	"Flash 8 - Medium Quality (400kbps)";
FLVCore_Prof_VP6_Med_Desc	=	"Video encoded for playback with Flash Player 8 or higher\nVideo codec: On2 VP6\nVideo data rate: 400kbps\nAudio codec: MPEG Layer III (MP3)\nAudio data rate: 96kbps (stereo)";
FLVCore_Prof_VP6_Med_XML	=	"<?xml version=\"1.0\" encoding=\"UTF-8\" ?><FLVCoreSettings><Version>2</Version><EncodeVideo><VideoCodec>vp6</VideoCodec><VideoDataRate>400000</VideoDataRate><Deinterlace>false</Deinterlace></EncodeVideo><EncodeAudio><AudioCodec>mp3</AudioCodec><AudioDataRate>96000</AudioDataRate><AudioChannels>2</AudioChannels></EncodeAudio></FLVCoreSettings>";

FLVCore_Prof_VP6_High		=	"Flash 8 - High Quality (700kbps)";
FLVCore_Prof_VP6_High_Desc	=	"Video encoded for playback with Flash Player 8 or higher\nVideo codec: On2 VP6\nVideo data rate: 700kbps\nAudio codec: MPEG Layer III (MP3)\nAudio data rate: 128kbps (stereo)";
FLVCore_Prof_VP6_High_XML	=	"<?xml version=\"1.0\" encoding=\"UTF-8\" ?><FLVCoreSettings><Version>2</Version><EncodeVideo><VideoCodec>vp6</VideoCodec><VideoDataRate>700000</VideoDataRate><Deinterlace>false</Deinterlace></EncodeVideo><EncodeAudio><AudioCodec>mp3</AudioCodec><AudioDataRate>128000</AudioDataRate><AudioChannels>2</AudioChannels></EncodeAudio></FLVCoreSettings>";

FLVCore_Prof_VP6_DV_Small		=	"Flash 8 - DV Small (400kbps)";
FLVCore_Prof_VP6_DV_Small_Desc	=	"N/A";
FLVCore_Prof_VP6_DV_Small_XML	=	"<?xml version=\"1.0\" encoding=\"UTF-8\" ?><FLVCoreSettings><Version>2</Version><EncodeVideo><VideoCodec>vp6</VideoCodec><VideoDataRate>400000</VideoDataRate><Resize><Width>320</Width><Height>240</Height><RespectAspectRatio>false</RespectAspectRatio></Resize><Deinterlace>true</Deinterlace></EncodeVideo><EncodeAudio><AudioCodec>mp3</AudioCodec><AudioDataRate>96000</AudioDataRate><AudioChannels>2</AudioChannels></EncodeAudio></FLVCoreSettings>";

FLVCore_Prof_VP6_DV_Large		=	"Flash 8 - DV Large (700kbps)";
FLVCore_Prof_VP6_DV_Large_Desc	=	"N/A";
FLVCore_Prof_VP6_DV_Large_XML	=	"<?xml version=\"1.0\" encoding=\"UTF-8\" ?><FLVCoreSettings><Version>2</Version><EncodeVideo><VideoCodec>vp6</VideoCodec><VideoDataRate>700000</VideoDataRate><Resize><Width>640</Width><Height>480</Height><RespectAspectRatio>false</RespectAspectRatio></Resize><Deinterlace>true</Deinterlace></EncodeVideo><EncodeAudio><AudioCodec>mp3</AudioCodec><AudioDataRate>128000</AudioDataRate><AudioChannels>2</AudioChannels></EncodeAudio></FLVCoreSettings>";

FLVCore_NewCuePtName		=	"New Cue Point";
FLVCore_NewParamName		=	"name_";
FLVCore_NewParamValue		=	"value";

Navigation	=	"Navigation";
Event		=	"Event";
